wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_dsi.h
/*!
    \file    gd32h77x_dsi.h
    \brief   definitions for the DSI

    \version 2025-09-29, V0.2.0, firmware for GD32H77x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32H77X_DSI_H
#define GD32H77X_DSI_H

#include "gd32h77x.h"

/* peripheral definitions */
#define DSI                           DSI_BASE                   /*!< DSI base address */

/* registers definitions */
#define DSI_DEVRDY                    REG32((DSI) + 0x00000000U) /*!< DSI Host device ready register */
#define DSI_INTSTAT0                  REG32((DSI) + 0x00000004U) /*!< DSI Host interrupt status register0 */
#define DSI_INTEN                     REG32((DSI) + 0x00000008U) /*!< DSI Host interrupt enable register */
#define DSI_FUNCPRG                   REG32((DSI) + 0x0000000CU) /*!< DSI Host function program register */
#define DSI_HSTXTO                    REG32((DSI) + 0x00000010U) /*!< DSI Host high speed tranmission timeout register */
#define DSI_LPRXTO                    REG32((DSI) + 0x00000014U) /*!< DSI Host low power reception timeout register */
#define DSI_TATO                      REG32((DSI) + 0x00000018U) /*!< DSI Host turn around timeout register */
#define DSI_DEVRSTTM                  REG32((DSI) + 0x0000001CU) /*!< DSI Host device reset timer register */
#define DSI_DPIRES                    REG32((DSI) + 0x00000020U) /*!< DSI Host DPI resolution register */
#define DSI_DCSWC                     REG32((DSI) + 0x00000024U) /*!< DSI Host DCS word count register */
#define DSI_HSACFG                    REG32((DSI) + 0x00000028U) /*!< DSI Host horizontal sync active count configuration register */
#define DSI_HBPCFG                    REG32((DSI) + 0x0000002CU) /*!< DSI Host horizontal back porch count configuration register */
#define DSI_HFPCFG                    REG32((DSI) + 0x00000030U) /*!< DSI Host horizontal front porch count configuration register */
#define DSI_HACFG                     REG32((DSI) + 0x00000034U) /*!< DSI Host horizontal active area count configuration register */
#define DSI_VSACFG                    REG32((DSI) + 0x00000038U) /*!< DSI Host vertical sync active count configuration register */
#define DSI_VBPCFG                    REG32((DSI) + 0x0000003CU) /*!< DSI Host vertical back porch count configuration register */
#define DSI_VFPCFG                    REG32((DSI) + 0x00000040U) /*!< DSI Host vertical front porch count configuration register */
#define DSI_DLCFG                     REG32((DSI) + 0x00000044U) /*!< DSI Host data lane high low switch count configuration register */
#define DSI_DPICTL                    REG32((DSI) + 0x00000048U) /*!< DSI Host DPI control register */
#define DSI_DPHY_PLLLK                REG32((DSI) + 0x0000004CU) /*!< DSI Host Dphy PLL lock count register */
#define DSI_INITCFG                   REG32((DSI) + 0x00000050U) /*!< DSI Host initialization count configuration register */
#define DSI_MAXRPKTCTL                REG32((DSI) + 0x00000054U) /*!< DSI Host maximum return packet control register */
#define DSI_VMFMT                     REG32((DSI) + 0x00000058U) /*!< DSI Host Video mode format register */
#define DSI_CKEOTCTL                  REG32((DSI) + 0x0000005CU) /*!< DSI Host clock EOT control register */
#define DSI_PLCTL                     REG32((DSI) + 0x00000060U) /*!< DSI Host polarity control register */
#define DSI_CKLSWCFG                  REG32((DSI) + 0x00000064U) /*!< DSI Host clock lane switching configuration register */
#define DSI_LPBCLKCFG                 REG32((DSI) + 0x00000068U) /*!< DSI Host low power byte clock configuration register */
#define DSI_DPHY_PCFG                 REG32((DSI) + 0x0000006CU) /*!< DSI Host Dphy parameter configuration register */
#define DSI_DPHY_CLTMPCFG             REG32((DSI) + 0x00000070U) /*!< DSI Host Dphy clock lane timing parameter configuration register */
#define DSI_DPHY_RSTENDFE             REG32((DSI) + 0x00000074U) /*!< DSI Host Dphy reset enable to DFE register */
#define DSI_DPHY_TRIMCTL0             REG32((DSI) + 0x00000078U) /*!< DSI Host Dphy trim control register 0 */
#define DSI_DPHY_TRIMCTL1             REG32((DSI) + 0x0000007CU) /*!< DSI Host Dphy trim control register 1 */
#define DSI_DPHY_TRIMCTL2             REG32((DSI) + 0x00000080U) /*!< DSI Host Dphy trim control register 2 */
#define DSI_DSKCTL                    REG32((DSI) + 0x00000088U) /*!< DSI Host deskew control register */
#define DSI_DSKTM                     REG32((DSI) + 0x0000008CU) /*!< DSI Host periodic deskew timer register */
#define DSI_DSKSTAT                   REG32((DSI) + 0x00000090U) /*!< DSI Host deskew status register */
#define DSI_EARCTL                    REG32((DSI) + 0x00000098U) /*!< DSI Host error auto recovery control register */
#define DSI_MIPIDIRDPISTAT            REG32((DSI) + 0x0000009CU) /*!< DSI Host MIPI direction and DPI status register */
#define DSI_PLSWAP                    REG32((DSI) + 0x000000A0U) /*!< DSI Host Polarity Swap register */
#define DSI_FMCTL                     REG32((DSI) + 0x000000A4U) /*!< DSI Host frequency mode control register */
#define DSI_TXDTWCFG                  REG32((DSI) + 0x000000B0U) /*!< DSI Host Tx data width configuration register */
#define DSI_LPCTL                     REG32((DSI) + 0x000000F8U) /*!< DSI Host LP control register */
#define DSI_LPDATA                    REG32((DSI) + 0x000000FCU) /*!< DSI Host LP data register */
#define DSI_HSCTL                     REG32((DSI) + 0x00000100U) /*!< DSI Host HS control register */
#define DSI_HSDATA                    REG32((DSI) + 0x00000104U) /*!< DSI Host HS data register */
#define DSI_FIFOSTAT                  REG32((DSI) + 0x00000108U) /*!< DSI Host FIFO status register */
#define DSI_INTSTAT1                  REG32((DSI) + 0x0000010CU) /*!< DSI Host interrupt status register1 */
#define DSI_WCTL                      REG32((DSI) + 0x00000200U) /*!< DSI Wrapper control register */
#define DSI_WINTEN                    REG32((DSI) + 0x00000204U) /*!< DSI Wrapper interrupt enable register */
#define DSI_WINTSTAT                  REG32((DSI) + 0x00000208U) /*!< DSI Wrapper interrupt and status register */
#define DSI_WINTC                     REG32((DSI) + 0x0000020CU) /*!< DSI Wrapper interrupt flag clear register */
#define DSI_WRGBDF                    REG32((DSI) + 0x00000210U) /*!< DSI Wrapper RGB data format register */
#define DSI_WCMDDS                    REG32((DSI) + 0x00000220U) /*!< DSI Wrapper command mode data source register */
#define DSI_WDMARCTL                  REG32((DSI) + 0x00000224U) /*!< DSI Wrapper DMA request control register */
#define DSI_WWMS_WCTL                 REG32((DSI) + 0x00000230U) /*!< DSI Wrapper WMS write control register */
#define DSI_WWMS_INTMSK               REG32((DSI) + 0x00000234U) /*!< DSI Wrapper WMS interrupt mask register */
#define DSI_WWMS_HEAD                 REG32((DSI) + 0x00000238U) /*!< DSI Wrapper WMS header message register */
#define DSI_WWMS_SIZE                 REG32((DSI) + 0x0000023CU) /*!< DSI Wrapper WMS size control register */
#define DSI_WWMS_STAT0                REG32((DSI) + 0x00000240U) /*!< DSI Wrapper WMS status register 0 */
#define DSI_WWMS_STAT1                REG32((DSI) + 0x00000244U) /*!< DSI Wrapper WMS status register 1 */

