wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_dsi.h
/* bits definitions */
/* DSI_DEVRDY */
#define DSI_DEVRDY_DEVRDY             BIT(0)              /*!< device ready */
#define DSI_DEVRDY_ULPS_STATE         BITS(1,2)           /*!< inform entire DSI host to enter ultra low power state(ULPS) */
#define DSI_DEVRDY_BUS_POSS           BIT(3)              /*!< display bus possession */

/* DSI_INTSTAT0 */
#define DSI_INTSTAT0_RXSOTE           BIT(0)              /*!< Rx sot error */
#define DSI_INTSTAT0_RXSOTSYNCE       BIT(1)              /*!< Rx sot sync error */
#define DSI_INTSTAT0_RXEOTSYNCE       BIT(2)              /*!< Rx eot sync error */
#define DSI_INTSTAT0_RXESCMEE         BIT(3)              /*!< Rx escape mode entry error */
#define DSI_INTSTAT0_RXLPTXSYNCE      BIT(4)              /*!< Rx LP tx sync error */
#define DSI_INTSTAT0_RXPTOE           BIT(5)              /*!< Rx peripheral timeout error */
#define DSI_INTSTAT0_RXFCTLE          BIT(6)              /*!< RxFalse control error */
#define DSI_INTSTAT0_RXECCSE          BIT(7)              /*!< Rx ECC single bit error */
#define DSI_INTSTAT0_RXECCME          BIT(8)              /*!< Rx ECC multibit error */
#define DSI_INTSTAT0_RXCHKE           BIT(9)              /*!< Rx checksum error */
#define DSI_INTSTAT0_RXDSIDTNR        BIT(10)             /*!< Rx DSI data type not recognized */
#define DSI_INTSTAT0_RXDSIVCIDINV     BIT(11)             /*!< Rx DSI virtual channel ID invalid */
#define DSI_INTSTAT0_TXFCTLE          BIT(12)             /*!< Tx false control error */
#define DSI_INTSTAT0_TXECCSE          BIT(13)             /*!< Tx ECC single bit error */
#define DSI_INTSTAT0_TXECCME          BIT(14)             /*!< Tx ECC multibit error */
#define DSI_INTSTAT0_TXCHKE           BIT(15)             /*!< Tx checksum(CRC) error */
#define DSI_INTSTAT0_TXDSIDTNR        BIT(16)             /*!< Tx DSI data type not recognised */
#define DSI_INTSTAT0_TXDSIVCIDINV     BIT(17)             /*!< Tx DSI virtual channel ID invalid */
#define DSI_INTSTAT0_HCONT            BIT(18)             /*!< high contention */
#define DSI_INTSTAT0_LCONT            BIT(19)             /*!< low contention */
#define DSI_INTSTAT0_FIFOE            BIT(20)             /*!< FIFO empty */
#define DSI_INTSTAT0_HSTXTO           BIT(21)             /*!< HS Tx timeout */
#define DSI_INTSTAT0_LPRXTO           BIT(22)             /*!< LP Rx timeout */
#define DSI_INTSTAT0_TAACKTO          BIT(23)             /*!< turn around ack timeout */
#define DSI_INTSTAT0_ACKNE            BIT(24)             /*!< ACK with no error */
#define DSI_INTSTAT0_RXINVTXCE        BIT(25)             /*!< Rx invalid transmission count error */
#define DSI_INTSTAT0_RXDSIPV          BIT(26)             /*!< Rx DSI protocol violation */
#define DSI_INTSTAT0_SPKTCMDS         BIT(27)             /*!< special packet command sent */
#define DSI_INTSTAT0_INIT_DONE        BIT(28)             /*!< DSI initialization is done */
#define DSI_INTSTAT0_RXCONTDET        BIT(29)             /*!< Rx contention detected */
#define DSI_INTSTAT0_DPILTO           BIT(30)             /*!< DPI line timeout */
#define DSI_INTSTAT0_DPIPE            BIT(31)             /*!< DPI program error */

/* DSI_INTEN */
#define DSI_INTEN_RXSOTEIE            BIT(0)              /*!< Rx sot error interrupt enable */
#define DSI_INTEN_RXSOTSYNCEIE        BIT(1)              /*!< Rx sot sync error interrupt enable */
#define DSI_INTEN_RXEOTSYNCEIE        BIT(2)              /*!< Rx eot sync error interrupt enable */
#define DSI_INTEN_RXESCMEEIE          BIT(3)              /*!< Rx escape mode entry error interrupt enable */
#define DSI_INTEN_RXLPTXSYNCEIE       BIT(4)              /*!< Rx LP tx sync error interrupt enable */
#define DSI_INTEN_RXPTOEIE            BIT(5)              /*!< Rx peripheral timeout error interrupt enable */
#define DSI_INTEN_RXFCTLEIE           BIT(6)              /*!< RxFalse control error interrupt enable */
#define DSI_INTEN_RXECCSEIE           BIT(7)              /*!< Rx ECC single bit error interrupt enable */
#define DSI_INTEN_RXECCMEIE           BIT(8)              /*!< Rx ECC multibit error interrupt enable */
#define DSI_INTEN_RXCHKEIE            BIT(9)              /*!< Rx checksum error interrupt enable */
#define DSI_INTEN_RXDSIDTNRIE         BIT(10)             /*!< Rx DSI data type not recognised interrupt enable */
#define DSI_INTEN_RXDSIVCIDINVIE      BIT(11)             /*!< Rx DSI virtual channel ID invalid interrupt enable */
#define DSI_INTEN_TXFCTLEIE           BIT(12)             /*!< Tx false control error interrupt enable */
#define DSI_INTEN_TXECCSEIE           BIT(13)             /*!< Tx ECC single bit error interrupt enable */
#define DSI_INTEN_TXECCMEIE           BIT(14)             /*!< Tx ECC multibit error interrupt enable */
#define DSI_INTEN_TXCHKEIE            BIT(15)             /*!< Tx checksum(CRC) error interrupt enable */
#define DSI_INTEN_TXDSIDTNRIE         BIT(16)             /*!< Tx DSI data type not recognised interrupt enable */
#define DSI_INTEN_TXDSIVCIDINVIE      BIT(17)             /*!< Tx DSI virtual channel ID invalid interrupt enable */
#define DSI_INTEN_HCONTIE             BIT(18)             /*!< high contention interrupt enable */
#define DSI_INTEN_LCONTIE             BIT(19)             /*!< low contention interrupt enable */
#define DSI_INTEN_FIFOEIE             BIT(20)             /*!< FIFO empty interrupt enable */
#define DSI_INTEN_HSTXTOIE            BIT(21)             /*!< HS Tx timeout interrupt enable */
#define DSI_INTEN_LPRXTOIE            BIT(22)             /*!< LP Rx timeout interrupt enable */
#define DSI_INTEN_TAACKTOIE           BIT(23)             /*!< turn around ack timeout interrupt enable */
#define DSI_INTEN_ACKNEIE             BIT(24)             /*!< ACK with no error interrupt enable */
#define DSI_INTEN_RXINVTXCEIE         BIT(25)             /*!< Rx invalid transmission count error interrupt enable */
#define DSI_INTEN_RXDSIPVIE           BIT(26)             /*!< Rx DSI protocol violation interrupt enable */
#define DSI_INTEN_SPKTCMDSIE          BIT(27)             /*!< special packet command sent interrupt enable */
#define DSI_INTEN_INIT_DONEIE         BIT(28)             /*!< DSI initialization is done interrupt enable */
#define DSI_INTEN_RXCONTDETIE         BIT(29)             /*!< Rx contention detected interrupt enable */
#define DSI_INTEN_DPILTOIE            BIT(30)             /*!< Enable DPI line timeout interrupt enable */
#define DSI_INTEN_DPIPEIE             BIT(31)             /*!< DPI program error interrupt enable */

/* DSI_FUNCPRG */
#define DSI_FUNCPRG_DTLANE_PRG        BITS(0,2)           /*!< number of data lanes */
#define DSI_FUNCPRG_VCHNUMVM          BITS(3,4)           /*!< virtual channel number for video mode */
#define DSI_FUNCPRG_VCHNUMCM          BITS(5,6)           /*!< virtual channel number for command mode */
#define DSI_FUNCPRG_SFMTVM            BITS(7,9)           /*!< supported colour format for video mode */
#define DSI_FUNCPRG_SDTWCM            BITS(13,15)         /*!< supported data width in command mode */

/* DSI_HSTXTO */
#define DSI_HSTXTO_HSTXTOCNT          BITS(0,23)          /*!< high speed transmission timeout counter */

