wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_dsi.h
/* DSI_WDMARCTL */
#define DSI_WDMARCTL_DMASRC              BITS(4,6)           /*!< DMA request source select */

/* DSI_WWMS_WCTL */
#define DSI_WWMS_WCTL_WMS_EN             BIT(0)              /*!< write memory split packet enable */
#define DSI_WWMS_WCTL_WMS_MODE           BIT(1)              /*!< WMS function used for different modes */
#define DSI_WWMS_WCTL_WMS_END            BIT(4)              /*!< write memory split packet end flag */

/* DSI_WWMS_INTMSK */
#define DSI_WWMS_INTMSK_WMS_ENDMSK       BIT(4)              /*!< WMS_END flag interrupt signal mask */

/* DSI_WWMS_HEAD */
#define DSI_WWMS_HEAD_FIRST_HEAD         BITS(0,7)           /*!< first split packet head message */
#define DSI_WWMS_HEAD_SECOND_HEAD        BITS(8,15)          /*!< secondary split packet head message */
#define DSI_WWMS_HEAD_LONG_DCS_CMD       BITS(16,23)         /*!< long packet DCS command */

/* DSI_WWMS_SIZE */
#define DSI_WWMS_SIZE_PKT_LEN            BITS(0,7)           /*!< divide the DMA into the length of each packet, in the number of words */
#define DSI_WWMS_SIZE_SUM_LEN            BITS(8,31)          /*!< the total number of words to be transferred by a single DMA trigger */

/* DSI_WWMS_STAT0 */
#define DSI_WWMS_STAT0_PKT_NUM           BITS(0,15)          /*!< current number of packets transferred */

/* DSI_WWMS_STAT1 */
#define DSI_WWMS_STAT1_SUM_CNT           BITS(0,23)          /*!< current count of transferred words */

/* constants definitions */
/* define the DSI bit position and its register index offset */
#define DSI_REGIDX_BIT(regidx, bitpos)    (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define DSI_REG_VAL(dsix, offset)         (REG32((dsix) + (((uint32_t)(offset) & 0x0000FFFFU) >> 6)))
#define DSI_BIT_POS(val)                  ((uint32_t)(val) & 0x0000001FU)
#define DSI_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16)\
                                                           | (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define DSI_REG_VAL2(dsix, offset)       (REG32((dsix) + ((uint32_t)(offset) >> 22)))
#define DSI_BIT_POS2(val)                (((uint32_t)(val) & 0x001F0000U) >> 16)

/* register offset */
#define DSI_DEVRDY_REG_OFFSET              0x00000000U           /*!< device ready register offset */
#define DSI_INTSTAT0_REG_OFFSET            0x00000004U           /*!< interrupt status register0 offset */
#define DSI_INTEN_REG_OFFSET               0x00000008U           /*!< interrupt enable register offset */
#define DSI_FUNCPRG_REG_OFFSET             0x0000000CU           /*!< function program register offset */
#define DSI_HSTXTO_REG_OFFSET              0x00000010U           /*!< high speed tranmission timeout register offset */
#define DSI_LPRXTO_REG_OFFSET              0x00000014U           /*!< low power reception timeout register offset */
#define DSI_TATO_REG_OFFSET                0x00000018U           /*!< turn around timeout register offset */
#define DSI_DEVRSTTM_REG_OFFSET            0x0000001CU           /*!< device reset timer register offset */
#define DSI_DPIRES_REG_OFFSET              0x00000020U           /*!< DPI resolution register offset */
#define DSI_DCSWC_REG_OFFSET               0x00000024U           /*!< DCS word count register offset */
#define DSI_HSACFG_REG_OFFSET              0x00000028U           /*!< horizontal sync active count configuration register offset */
#define DSI_HBPCFG_REG_OFFSET              0x0000002CU           /*!< horizontal back porch count configuration register offset */
#define DSI_HFPCFG_REG_OFFSET              0x00000030U           /*!< horizontal front porch count configuration register offset */
#define DSI_HACFG_REG_OFFSET               0x00000034U           /*!< horizontal active area count configuration register offset */
#define DSI_VSACFG_REG_OFFSET              0x00000038U           /*!< vertical sync active count configuration register offset */
#define DSI_VBPCFG_REG_OFFSET              0x0000003CU           /*!< vertical back porch count configuration register offset */
#define DSI_VFPCFG_REG_OFFSET              0x00000040U           /*!< vertical front porch count configuration register offset */
#define DSI_DLCFG_REG_OFFSET               0x00000044U           /*!< data lane high low switch count configuration register offset */
#define DSI_DPICTL_REG_OFFSET              0x00000048U           /*!< DPI control register offset */
#define DSI_DPHY_PLLLK_REG_OFFSET          0x0000004CU           /*!< Dphy PLL lock count register offset */
#define DSI_INITCFG_REG_OFFSET             0x00000050U           /*!< initialization count configuration register offset */
#define DSI_MAXRPKTCTL_REG_OFFSET          0x00000054U           /*!< maximum return packet control register offset */
#define DSI_VMFMT_REG_OFFSET               0x00000058U           /*!< video mode format register offset */
#define DSI_CKEOTCTL_REG_OFFSET            0x0000005CU           /*!< clock EOT control register offset */
#define DSI_PLCTL_REG_OFFSET               0x00000060U           /*!< polarity control register offset */
#define DSI_CKLSWCFG_REG_OFFSET            0x00000064U           /*!< clock lane switching configuration register offset */
#define DSI_LPBCLKCFG_REG_OFFSET           0x00000068U           /*!< low power byte clock configuration register offset */
#define DSI_DPHY_PCFG_REG_OFFSET           0x0000006CU           /*!< Dphy parameter configuration register offset */
#define DSI_DPHY_CLTMPCFG_REG_OFFSET       0x00000070U           /*!< Dphy clock lane timing parameter configuration register offset */
#define DSI_DPHY_RSTENDFE_REG_OFFSET       0x00000074U           /*!< Dphy reset enable to DFE register offset */
#define DSI_DPHY_TRIMCTL0_REG_OFFSET       0x00000078U           /*!< Dphy trim control register 0 offset */
#define DSI_DPHY_TRIMCTL1_REG_OFFSET       0x0000007CU           /*!< Dphy trim control register 1 offset */
#define DSI_DPHY_TRIMCTL2_REG_OFFSET       0x00000080U           /*!< Dphy trim control register 2 offset */
#define DSI_DSKCTL_REG_OFFSET              0x00000088U           /*!< deskew control register offset */
#define DSI_DSKTM_REG_OFFSET               0x0000008CU           /*!< periodic deskew timer register offset */
#define DSI_DSKSTAT_REG_OFFSET             0x00000090U           /*!< deskew status register offset */
#define DSI_EARCTL_REG_OFFSET              0x00000098U           /*!< error auto recovery control register offset */
#define DSI_MIPIDIRDPISTAT_REG_OFFSET      0x0000009CU           /*!< MIPI direction and DPI status register offset */
#define DSI_PLSWAP_REG_OFFSET              0x000000A0U           /*!< polarity swap register offset */
#define DSI_FMCTL_REG_OFFSET               0x000000A4U           /*!< frequency mode control register offset */
#define DSI_TXDTWCFG_REG_OFFSET            0x000000B0U           /*!< Tx data width configuration register offset */
#define DSI_LPCTL_REG_OFFSET               0x000000F8U           /*!< LP control register offset */
#define DSI_LPDATA_REG_OFFSET              0x000000FCU           /*!< LP data register offset */
#define DSI_HSCTL_REG_OFFSET               0x00000100U           /*!< HS control register offset */
#define DSI_HSDATA_REG_OFFSET              0x00000104U           /*!< HS data register offset */
#define DSI_FIFOSTAT_REG_OFFSET            0x00000108U           /*!< FIFO status register offset */
#define DSI_INTSTAT1_REG_OFFSET            0x0000010CU           /*!< interrupt status register1 offset */
#define DSI_WCTL_REG_OFFSET                0x00000200U           /*!< wrapper control register offset */
#define DSI_WINTEN_REG_OFFSET              0x00000204U           /*!< wrapper interrupt enable register offset */
#define DSI_WINTSTAT_REG_OFFSET            0x00000208U           /*!< wrapper interrupt and status register offset */
#define DSI_WINTC_REG_OFFSET               0x0000020CU           /*!< wrapper interrupt flag clear register offset */
#define DSI_WRGBDF_REG_OFFSET              0x00000210U           /*!< wrapper RGB data format register offset */
#define DSI_WCMDDS_REG_OFFSET              0x00000220U           /*!< wrapper command mode data source register offset */
#define DSI_WDMARCTL_REG_OFFSET            0x00000224U           /*!< wrapper DMA request control register offset */
#define DSI_WWMS_WCTL_REG_OFFSET           0x00000230U           /*!< wrapper WMS write control register offset */
#define DSI_WWMS_INTMSK_REG_OFFSET         0x00000234U           /*!< wrapper WMS interrupt mask register offset */
#define DSI_WWMS_HEAD_REG_OFFSET           0x00000238U           /*!< wrapper WMS header message register offset */
#define DSI_WWMS_SIZE_REG_OFFSET           0x0000023CU           /*!< wrapper WMS size control register offset */
#define DSI_WWMS_STAT0_REG_OFFSET          0x00000240U           /*!< wrapper WMS status register 0 offset */
#define DSI_WWMS_STAT1_REG_OFFSET          0x00000244U           /*!< wrapper WMS status register 1 offset */

/* device ready */
#define DSI_DEVICE_NOT_READY               0x00000000U           /*!< not ready */
#define DSI_DEVICE_READY                   DSI_DEVRDY_DEVRDY     /*!< ready */

/* ULPS state */
#define DSI_ULPS_STATE(regval)             (BITS(1,2) & ((uint32_t)(regval) << 1))
#define DSI_ULPS_NORMAL_OPERATION          DSI_ULPS_STATE(0)     /*!< normal operation */
#define DSI_ULPS_EXIT_MODE                 DSI_ULPS_STATE(1)     /*!< ultra low power EXIT mode */
#define DSI_ULPS_POWER_SAVING_MODE         DSI_ULPS_STATE(2)     /*!< ultra low power [POWER SAVING] mode */

/* display bus possession */
#define DSI_BUS_POSSESSION_STOP            0x00000000U           /*!< stop the display bus possession of the DSI receive */
#define DSI_BUS_POSSESSION_RECEIVE         DSI_DEVRDY_BUS_POSS   /*!< inform that DSI receiver has to be given bus possession for receiving the tearing effect trigger message */

