wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_dsi.h
/* data lanes number */
#define DSI_DTLANE_PRG(regval)             (BITS(0,2) & ((uint32_t)(regval)))
#define DSI_DATA_LANE_ONE                  DSI_DTLANE_PRG(1)                     /*!< one data lane */
#define DSI_DATA_LANE_TWO                  DSI_DTLANE_PRG(2)                     /*!< two data lane */

/* virtual channel number for video mode or command mode */
#define DSI_VIRTUAL_CHANNEL_0              0x00000000U                           /*!< virtual channel 0 */
#define DSI_VIRTUAL_CHANNEL_1              0x00000001U                           /*!< virtual channel 1 */
#define DSI_VIRTUAL_CHANNEL_2              0x00000002U                           /*!< virtual channel 2 */
#define DSI_VIRTUAL_CHANNEL_3              0x00000003U                           /*!< virtual channel 3 */

/* supported color format for video mode */
#define DSI_SFMTVM(regval)                 (BITS(7,9) & ((uint32_t)(regval) << 7))
#define DSI_VIDEO_MODE_DISABLE             DSI_SFMTVM(0)                         /*!< Video mode is not supported */
#define DSI_VIDEO_MODE_FMT_RGB565          DSI_SFMTVM(1)                         /*!< RGB565 or 16-bit format */
#define DSI_VIDEO_MODE_FMT_RGB666          DSI_SFMTVM(2)                         /*!< RGB666 or 18-bit format */
#define DSI_VIDEO_MODE_FMT_RGB666LP        DSI_SFMTVM(3)                         /*!< RGB666 loosely packed format */
#define DSI_VIDEO_MODE_FMT_RGB888          DSI_SFMTVM(4)                         /*!< RGB888 or 24-bit format */

typedef enum {
    DSI_VIDEO_MODE                         = 0x0U,                               /*!< Video mode */
    DSI_COMMAND_MODE                       = 0x4U,                               /*!< Command mode */
} dsi_mode_enum;

/* supported data width in command mode */
#define DSI_SDTWCM(regval)                 (BITS(13,15) & ((uint32_t)(regval) << 13))
#define DSI_CMD_MODE_DTW_8BIT              DSI_SDTWCM(0)                         /*!< 8-bit data width */
#define DSI_CMD_MODE_DTW_16BIT             DSI_SDTWCM(1)                         /*!< 16-bit data width */
#define DSI_CMD_MODE_DTW_24BIT             DSI_SDTWCM(2)                         /*!< 24-bit data width */

/* indicates the data transfer type */
#define DSI_TRANSFER_HS                    0x00000000U                           /*!< high-speed transfer */
#define DSI_TRANSFER_LP                    DSI_MAXRPKTCTL_HS_LP                  /*!< low-power transfer */

/* DSI polarity selections */
#define DSI_POLARITY(regval)               (BITS(0,3) & ((uint32_t)(regval)))
#define DSI_VSYNC_POLARITY                 DSI_POLARITY(0)                       /*!< vsync */
#define DSI_HSYNC_POLARITY                 DSI_POLARITY(1)                       /*!< hsync */
#define DSI_SHUTDOWN_POLARITY              DSI_POLARITY(2)                       /*!< shutdown */
#define DSI_COLOR_MODE_POLARITY            DSI_POLARITY(3)                       /*!< color mode */

/* DSI polarity swap selections */
#define DSI_VSYNC_POLARITY_SWAP            DSI_PLSWAP_VSPL                       /*!< vsync polarity swap */
#define DSI_HSYNC_POLARITY_SWAP            DSI_PLSWAP_HSPL                       /*!< hsync polarity swap */
#define DSI_SHUTDOWN_POLARITY_SWAP         DSI_PLSWAP_SDPL                       /*!< shutdown polarity swap */
#define DSI_COLORMODE_POLARITY_SWAP        DSI_PLSWAP_CMPL                       /*!< color mode polarity swap */

/* DSI deskew calibration selections */
#define DSI_DSKCTL_CALIB(regval)           (BITS(0,1) & ((uint32_t)(regval)))
#define DSI_DESKEW_DISABLE                 DSI_DSKCTL_CALIB(0)                   /*!< deskew calibration disable */
#define DSI_INIT_DESKEW_ENABLE             DSI_DSKCTL_CALIB(1)                   /*!< init deskew calibration enable */
#define DSI_PERIODIC_DESKEW_ENABLE         DSI_DSKCTL_CALIB(2)                   /*!< periodic deskew calibration enable */

/* DSI WMS mode selections */
#define DSI_WMS_MODE_HS                    0x00000000U                           /*!< WMS HS mode */
#define DSI_WMS_MODE_LP                    DSI_WWMS_WCTL_WMS_MODE                /*!< WMS LP mode */

/* DSI RGB data format */
#define DSI_WRGBDF_FORMAT(regval)          (BITS(0,2) & ((uint32_t)(regval)))
#define DSI_TLI_DATA_FORMAT_RGB565         DSI_WRGBDF_FORMAT(1)                  /*!< RGB565 format */
#define DSI_TLI_DATA_RGB888                DSI_WRGBDF_FORMAT(0)                  /*!< RGB888 format */
#define DSI_TLI_DATA_RGB888_TO_RGB666      DSI_WRGBDF_FORMAT(2)                  /*!< RGB888 to RGB666 format */
#define DSI_TLI_DATA_RGB565_TO_RGB666      DSI_WRGBDF_FORMAT(3)                  /*!< RGB565 to RGB666 format */

/* DSI tearing effect source */
#define DSI_TE_EXTERNAL_PIN                DSI_WCTL_TESRC                        /*!< external TE source */
#define DSI_TE_DSI_LINK                    0x00000000U                           /*!< DSI packet TE source */

/* DSI TLI DMA mode */
#define DSI_TLI_DMA_MODE_DISABLE           0x00000000U                           /*!< DMA mode disable, DMA used by TLI */
#define DSI_TLI_DMA_MODE_ENABLE            DSI_WCTL_TLIDMA                       /*!< DMA mode enable, DMA used by DSI */

/* DSI TE pin polarity*/
#define DSI_TE_POL_RISING_EDGE             0x00000000U                           /*!< TE pin polarity is rising edge */
#define DSI_TE_POL_FALLING_EDGE            DSI_WCTL_TEPOL                        /*!< TE pin polarity is falling edge */

/* DSI color mode */
#define DSI_FULL_COLOR_MODE                0x00000000U                           /*!< Full color mode */
#define DSI_EIGHT_COLOR_MODE               DSI_WCTL_CLM                          /*!< Eight color mode */

/* DSI shundown */
#define DSI_SHUTDOWN_DISPLAY_ON            0x00000000U                           /*!< display ON */
#define DSI_SHUTDOWN_DISPLAY_OFF           DSI_WCTL_SHTD                         /*!< display OFF */

/* DSI wrapper command mode data source */
#define DSI_HS_DATASRC_HSDATA              0x00000000U                           /*!< From DSI_HSDATA(0x104) */
#define DSI_HS_DATASRC_TLI_DMA             DSI_WCMDDS_HSCMDDS                    /*!< From TLI DMA */
#define DSI_LP_DATASRC_LPDATA              0x00000000U                           /*!< From DSI_LPDATA(0xFC) */
#define DSI_LP_DATASRC_TLI_DMA             DSI_WCMDDS_LPCMDDS                    /*!< From TLI DMA */

